---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelLine
source: html/5a3e8eb2-6114-db7c-deba-09696534b6e4.htm
---
# ModelLine Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.